ВЫБРАТЬ
    ЦеныАктуальные.Номенклатура,
    ЦеныАктуальные.Дата,
    ЦеныАктуальные.Цена
ИЗ
    РегистрСведений.ЦеныТовара КАК ЦеныАктуальные
        ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
            ВЫБРАТЬ
                ЦеныМакс.Номенклатура КАК Номенклатура,
                МАКСИМУМ(ЦеныМакс.Дата) КАК МаксимальнаяДата
            ИЗ
                РегистрСведений.ЦеныТовара КАК ЦеныМакс
            ГДЕ
                ЦеныМакс.Дата <= &ЗаданнаяДата
            СГРУППИРОВАТЬ ПО
                ЦеныМакс.Номенклатура
        ) КАК ПоследниеДаты
        ПО ЦеныАктуальные.Номенклатура = ПоследниеДаты.Номенклатура
            И ЦеныАктуальные.Дата = ПоследниеДаты.МаксимальнаяДата




ВЫБРАТЬ
    ЦеныТовара.Номенклатура,
    ЦеныТовара.Дата,
    ЦеныТовара.Цена
ИЗ
    РегистрСведений.ЦеныТовара КАК ЦеныТовара
ГДЕ
    ЦеныТовара.Дата <= &ЗаданнаяДата
    И НЕ СУЩЕСТВУЕТ (
        ВЫБРАТЬ 1
        ИЗ РегистрСведений.ЦеныТовара КАК ЦеныПозже
        ГДЕ
            ЦеныПозже.Номенклатура = ЦеныТовара.Номенклатура
            И ЦеныПозже.Дата > ЦеныТовара.Дата
            И ЦеныПозже.Дата <= &ЗаданнаяДата
    )