Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
    |    Цены.Номенклатура,
    |    Цены.Цена
|ИЗ
|    РегистрСведений.ЦеныТовара КАК Цены
|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
|            ВЫБРАТЬ
|                Внутр.Номенклатура,
|                МАКСИМУМ(Внутр.Дата) КАК МаксДата
|            ИЗ
|                РегистрСведений.ЦеныТовара КАК Внутр
|            ГДЕ
|                Внутр.Дата <= &Дата
|            СГРУППИРОВАТЬ ПО
|                Внутр.Номенклатура
|        ) КАК МаксДаты
|        ПО Цены.Номенклатура = МаксДаты.Номенклатура
|            И Цены.Дата = МаксДаты.МаксДата";

Запрос.УстановитьПараметр("Дата", ДатаПараметр);
Результат = Запрос.Выполнить().Выгрузить();