Запрос = Новый Запрос;
Запрос.Текст =
"ВЫБРАТЬ
|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
|	МАКСИМУМ(ЦеныНоменклатуры.Дата) КАК Дата
|ПОМЕСТИТЬ ВТ_ПоследниеДаты
|ИЗ
|	РегистрСведений.ЦеныТовара КАК ЦеныНоменклатуры
|ГДЕ
|	ЦеныНоменклатуры.Дата <= &ДатаАктуальности
|
|СГРУППИРОВАТЬ ПО
|	ЦеныНоменклатуры.Номенклатура
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ЦеныТовара.Номенклатура,
|	ЦеныТовара.Цена
|ИЗ
|	РегистрСведений.ЦеныТовара КАК ЦеныТовара
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследниеДаты КАК ВТ_ПоследниеДаты
|		ПО ЦеныТовара.Номенклатура = ВТ_ПоследниеДаты.Номенклатура
|			И ЦеныТовара.Дата = ВТ_ПоследниеДаты.Дата";

// Установить параметр запроса
// Запрос.УстановитьПараметр("ДатаАктуальности", НужнаяДата);

// Результат = Запрос.Выполнить().Выгрузить();
