ВЫБРАТЬ
    ПоследниеЦены.Номенклатура,
    ЦеныТоваров.Цена
ИЗ
    (
        ВЫБРАТЬ
            ЦеныТоваров.Номенклатура КАК Номенклатура,
            МАКСИМУМ(ЦеныТоваров.Дата) КАК Дата
        ИЗ
            РегистрСведений.ЦеныТовара КАК ЦеныТоваров
        ГДЕ
            ЦеныТоваров.Дата <= &Дата
        СГРУППИРОВАТЬ ПО
            ЦеныТоваров.Номенклатура
    ) КАК ПоследниеЦены
    ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТовара КАК ЦеныТоваров
    ПО (ПоследниеЦены.Номенклатура = ЦеныТоваров.Номенклатура)
        И (ПоследниеЦены.Дата = ЦеныТоваров.Дата)