&НаКлиенте
Процедура ЗаписатьКомментарий(Команда)
    
    ТекстКомментария = Комментарий;          // реквизит формы
    ТекстКомментария = ТекстКомментария + ?(ПустаяСтрока(ТекстКомментария), "", " ") + "Тест";
    
    Комментарий = ТекстКомментария;          // записали в реквизит формы
    
    // Запишем объект без закрытия формы
    ОписаниеОповещения = Новый ОписаниеОповещений(
        "ПослеЗаписи", ЭтаФорма);
    
    // Если документ проводится — укажите нужный параметр 1 или 0
    Объект.Записать(РежимРеквизита "ВводНаОсновании", ОписаниеОповещения);
    
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(Результат, ДополнительныеПараметры) Экспорт
    // По необходимости обработать ошибки:
    // Если НЕ Результат.Успешно Тогда
    //     Сообщить(Результат.ПолучитьОповещение().Сообщение());
    // КонецЕсли;
КонецПроцедуры