// Процедура для заполнения массива случайными числами и сортировки методом пузырька
Процедура ЗаполнитьИСортироватьМассив() Экспорт

    // Создаем массив
    Массив = Новый Массив;

    // Генератор случайных чисел
    ГСЧ = Новый ГенераторСлучайныхЧисел();

    КоличествоЭлементов = 10;
    МинимальноеЧисло = 1;
    МаксимальноеЧисло = 100;

    // Заполняем массив случайными целыми числами
    Для i = 1 По КоличествоЭлементов Цикл
        Массив.Добавить(ГСЧ.СлучайноеЧисло(МинимальноеЧисло, МаксимальноеЧисло));
    КонецЦикла;

    // Сортировка методом пузырька
    N = Массив.Количество();
    
    Для i = 0 По N - 2 Цикл
        
        Для j = 0 По N - i - 2 Цикл
            
            Если Массив[j] > Массив[j + 1] Тогда
                Temp = Массив[j];
                Массив[j] = Массив[j + 1];
                Массив[j + 1] = Temp;
            КонецЕсли;
            
        КонецЦикла;
        
    КонецЦикла;

КонецПроцедуры
