Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	ТаблицаЦен.Номенклатура КАК Номенклатура,
|	ТаблицаЦен.Дата КАК Дата,
|	ТаблицаЦен.Количество КАК Количество,
|	ТаблицаЦен.Цена КАК Цена
|ПОМЕСТИТЬ ВТ_Цены
|ИЗ
|	&ТаблицаЦен КАК ТаблицаЦен
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ_Цены.Цена КАК Цена,
|	ВТ_Цены.Количество КАК Количество
|ИЗ
|	ВТ_Цены КАК ВТ_Цены
|ГДЕ
|	ВТ_Цены.Номенклатура = &Номенклатура
|	И ВТ_Цены.Дата = &ДатаЦены";

// Установка параметров
Запрос.УстановитьПараметр("ТаблицаЦен", ТаблицаЦен);
Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены);

// Выполнение запроса
РезультатЗапроса = Запрос.Выполнить();