Запрос = Новый Запрос;
Запрос.Текст = 
    "ВЫБРАТЬ
    |    ТаблицаЗначений.Номенклатура,
    |    МАКСИМУМ(ТаблицаЗначений.Дата) КАК МаксДата,
    |    МАКСИМУМ(ТаблицаЗначений.Цена) КАК Цена
    |ИЗ
    |    &ТаблицаЗначений КАК ТаблицаЗначений
    |ГДЕ
    |    ТаблицаЗначений.Дата <= &ЗаданнаяДата
    |СГРУППИРОВАТЬ ПО
    |    ТаблицаЗначений.Номенклатура";

Запрос.УстановитьПараметр("ТаблицаЗначений", ТаблицаЗначений);
Запрос.УстановитьПараметр("ЗаданнаяДата", ЗаданнаяДата);

Результат = Запрос.Выполнить().Выгрузить();